/* В js існує три способи оголошення змінних (let, const, var(legacy - у нових проектах майже не 
використувається,але у старих проектах можна зустріти))
Приклади оголошення змінних: let variable_name = variable_value
*/

//Variables

let age = 30; // змінна, яку можна змінювати
console.log(age);
const pi = 3.14; // змінна, яка не змінюється
console.log(pi);
// var oldSyntax = "Hello"; // старий формат

/* В яких ситуаціях при оголошенні змінних ми використовуємо let, const, var ?
let - використовуємо тоді коли розуміємо, що значення змінної може бути змінненим */

age = 31;
console.log(age)

//Очевидно стає, що оголошена змінна за допомогою слова const не може бути зміненою після присвоєння
// Питання, що виведеться в консолі на 21 рядку ?
pi = 3.20
console.log(pi)


// Data Types
/* Отже, типи даних. Насамперед вони діляться на примітивні й обєктні
Примітивні типи:

• Boolean (Логічний тип) — Приймає значення true або false (істина або).
• Number (Число) - 12, 43.5, 1, 0 
• String (Рядок або стрічка) — 'hey, let's learn js'
• Undefined (Невизначений тип) — простіше кажучи, якщо ми створили
змінну, але нічого їй не привласнили — ця змінна матиме значення
undefined.
• Null (Позначає відсутність значення або "пустоту".
• Symbol - Унікальні ідентифікатори, які гарантують унікальність.Використовуються, наприклад, як ключі для об'єктів. let id = Symbol("uniqueID");
*/

const obj = {
    name: 'Volodymyr',
    age: 14,
    isMarried: true
}

console.log(obj.isMarried)
if(3 > 5){
    res = 'hey'
}
else {
    res = 'john'
}





